app/controllers/battles_controller.rb

  def show
    @battle = Battle.find(1)
---
SELECT  "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT 1  [["id", 1]]