app/controllers/geolocations_controller.rb

  def create
    @user = find_user_by_email
    @user_geolocation = Geolocation.create(user: @user, lonlat: make_wkt_point)

    @challenger = @user_geolocation.find_closest_challenger
    if @challenger
      @challenger_geolocation = @challenger.geolocations.last

      @user.in_battle = true
      @challenger.in_battle = true

      @battle = Battle.create(task_id: 1)
---
INSERT INTO "geolocations" ("user_id", "lonlat", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["lonlat", "0020000001000010e6c05e81ea9a123a6a4042aa53a6f11b0b"], ["created_at", "2016-04-24 17:32:20.659688"], ["updated_at", "2016-04-24 17:32:20.659688"]]
INSERT INTO "users" ("username", "email", "password_digest", "image_url") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT  "geolocations".* FROM "geolocations" WHERE "geolocations"."user_id" = $1  ORDER BY "geolocations"."id" DESC LIMIT 1  [["user_id", 7]]
INSERT INTO "battles" ("task_id") VALUES ($1) RETURNING "id"  [["task_id", 1]]

  def find_user_by_email
    User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jpcase104@gmail.com"]]